package com.zagar.tourism.enums;

/**
 * Created by naayadaa on 16.08.16.
 */
public enum Board {
    RO, BB, HB, HBpl, FB, AI, UAI, HCAI
}
/*RO - room only - размещение без питания;
BB - bed & breakfast - только завтрак;
HB - half board - полупансион: завтрак и ужин (шведский стол), бесплатно чай, кофе, вода на завтрак;
HB+ - half board plus - полупансион: завтрак и ужин (шведский стол), плюс алкогольные и безалкогольные напитки местного производства во время приёма пищи;
FB - full board - полный пансион: завтрак, обед и ужин (шведский стол);
FB+ (EFB) - full board plus (extra full board) - полный пансион: завтрак, обед и ужин (шведский стол), плюс напитки (в ряде отелей пиво и вино) во время приема пищи;
AI - all inclusive - "все включено": полный пансион, алкогольные и безалкогольные напитки местного производства;
UAI (Ultra All inclusive) All inclusive плюс импортные спиртные напитки и дополнительные услуги по усмотрению администрации;
HCAI - High class all Inclusive - все бесплатно, кроме магазинов, телефона, врача, парикмахерской, некоторых водных видов спорта и подводного плавания;
*/